export const intro = {
  titleFa: 'معرفی',
  titleEn: 'Introduction',
  descriptionFa: 'سلام! من فرزانم. ساکن تهران و فعلا سرگرم فرانت اندم.',
  descriptionEn: ''
}

export const careerPath = {
  titleFa: 'مسیر شغلی؟',
  titleEn: 'Career Path?',
  descriptionFa: 'من از اواسط سال 2018 به صورت تفریحی شروع به کد زنی و ساختن تمپلیت با HTML، CSS و JS کردم و تا حدی با پایه های وب آشنا شدم. از اوایل سال 2019 به صورت رسمی به عنوان فرانت اند دولوپر مشغول شدم. اون اوایل با Angularjs و jquery کار میکردم و در جایی که مشغول بودم مشغول نگهداری و توسعه سورس کد بودم. بعدش یه مقداری با Angular کار کردم و اونجا با TS و Rxjs آشنا شدم. اما خیلی از انگولار سنس خوبی نگرفتم. محل کارم رو عوض کردم و با Vuejs آشنا و درش عمیق شدم. در حال حاضر هم فریمورک ویو و انواع ابزارهای کناریش مثل nuxtjs، vuetify، vuex و بقیه موارد موجود توی اکوسیستم ویو رو امتحان و باهاشون تا حد خوبی کار کردم. جدیدا به reactjs هم علاقه مند شدم و دارم تا جای ممکن یادش میگیرم و ازش لذت خیلی زیادی میبرم.',
  descriptionEn: ''
}

export const careerIntrests = {
  titleFa: 'علایق شغلی؟',
  titleEn: 'Career Intrests?',
  descriptionFa: 'کلا به دنیای اپن سورس علاقه خیلی زیادی دارم. از لینوکس لذت میبرم و سعی میکنم بیشتر یاد بگیرمش. با JS که کلا اخت ام و دوس دارم کلا چیزایی که با JS یا پایه های اون نوشته میشن مثل nodejs و mongodb رو امتحان کنم! اما اگه روزی بخوام زبون دیگه ای غیر از JS رو تووش عمیق شم احتمالا Go یا Rust باشه. کسی چی میدونه از فردا! 😊 فضای وب در کل فضای مورد علاقه مه. همون اندازه که فرانت رو دوس دارم به بکند هم علاقه دارم چون هدفم در کل اینه که مهندس نرم افزار خوبی باشم. به صورت کلی عاشق حل مسئله م خصوصا اگه اون مسئله بیزینسی باشه و لازم باشه به کد تبدیل بشه! یکی از لذت های جدیم اینه که طرز کار چیزهای پیچیده رو یاد بگیرم. حالا میخواد موتور ماشین باشه یا فرایند سازمانی پیچیده ای که قراره اتوماسیون بشه! در آخر اینم اضافه کنم که کلین کد برام خیلی مهمه. نظرم کلین کد در کنار راه حل های ساده برای مسائل مختلف معجزه میکنه!',
  descriptionEn: ''
}

export  const personalIntrests = {
  titleFa: 'علایق شخصی؟',
  titleEn: 'Personal Intrests?',
  descriptionFa: 'من عاشق موسیقیم. بدون موسیقی خیلی دووم نمیارم! سبک راک و متال مثل خونه م میمونه ولی سبک های دیگه رو هم گوش میدم بدون هیچ تعصبی! رپ و دنس پاپ رو هم خیلی دوس دارم. خیلی فیلم و سریال نمیبینم ولی خب ب ژانرهای مافیایی و علمی تخیلی خیلی حال میکنم. بیشتر علاقه مند به گیم هستم تا فیلم. مخصوصا گیم هایی که داستان خیلی خفنی داشته باشه. فوتبال خیلی دوس دارم و بارسایی-میلانی تمام عیارم. حالا اینکه چرا دو تا تیم رو دوس دارم داستان داره! همچنین به انواع سلاح های نظامی و خصوصا هواپیماهای جنگنده و کلا چیزای پیچیده داخل صنعت نظامی هم خیلی علاقه دارم و اخبارشونو همیشه دنبال میکنم. در نهایت میتونم بگم که به مینیمالیسم توی زندگیم خیلی اعتقاد دارم و بیشتر طرفدار سادگیم. به بودیسم اعتقاد ندارم ولی خب از تکنیک هاش و روش های زندگیشون الهام میگیرم تا حال روحم همیشه خوب باشه. جدیدا هم با دائو آشنا شدم و از طرز تفکرش خوشم اومده و بیشتر دارم ازش میخونم.',
  descriptionEn: ''
}